Revit 2026 API

# CategorySetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CategorySetIterator()
```
```vb
Public Sub New
```
```cpp
public:
CategorySetIterator()
```
```fsharp
new : unit -> CategorySetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

CategorySetIterator Class

Autodesk.Revit.DB Namespace